#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jyablonski_prac/github-terraform-demo/runs/run-SGjUq53WeFQjv913

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_role.jacobs_lambda_s3_role: Refreshing state... [id=jacobs_lambda_s3_role]
aws_cloudwatch_log_group.aws_ecs_logs: Refreshing state... [id=jacobs_ecs_logs]
aws_cloudwatch_log_group.jacobs_adhoc_sns_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_adhoc_lambda_function]
aws_sns_topic.jacobs_adhoc_sns_topic: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-adhoc-sns-topic]
aws_s3_bucket.jyablonski_mlflow_bucket: Refreshing state... [id=jyablonski-mlflow-bucket]
aws_ecr_repository.jacobs_repo: Refreshing state... [id=jacobs_repo]
aws_iam_policy.lambda_sns_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda-sns-policy]
aws_ssm_parameter.jacobs_ssm_prac_public: Refreshing state... [id=jacobs_ssm_test]
aws_cloudwatch_log_group.jacobs_es_cluster_logs: Refreshing state... [id=jacobs-es-cluster-logs]
aws_s3_bucket.jyablonski_lambda_bucket: Refreshing state... [id=jyablonski-lambda-bucket]
aws_s3_bucket.jacobs_sqs_sns_bucket: Refreshing state... [id=jacobs-sqs-bucket]
aws_iam_policy.glue_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/jacobs_glue_policy]
aws_iam_policy.jacobs_lambda_logging: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda_logging]
aws_s3_bucket.jacobs_kinesis_bucket: Refreshing state... [id=jacobs-kinesis-bucket]
aws_dynamodb_table.jacobs_dynamodb_table: Refreshing state... [id=product-inventory]
aws_s3_bucket.jyablonski_unhappy_bucket: Refreshing state... [id=jyablonski-unhappy-bucket]
aws_vpc.jacobs_vpc_tf: Refreshing state... [id=vpc-00ef7bc92037b5bf0]
aws_key_pair.mlflow_ec2_key: Refreshing state... [id=jacobs_mlflow_key]
aws_s3_bucket.jacobs_bucket_tf: Refreshing state... [id=jacobsbucket97]
aws_cloudwatch_log_group.jacobs_glue_logs: Refreshing state... [id=jacobs-glue-logs]
aws_iam_user.jacobs_airflow_user: Refreshing state... [id=jacobs_airflow_user]
aws_iam_user.jacobs_github_user: Refreshing state... [id=jacobs-github-ci]
aws_iam_role.jacobs_ecs_role: Refreshing state... [id=jacobs_ecs_role]
aws_cloudwatch_event_rule.etl_rule_ml: Refreshing state... [id=python_scheduled_task_ml]
aws_cloudwatch_log_subscription_filter.jacobs_lambda_es_logs_stream: Refreshing state... [id=cwlsf-3005192471]
aws_cloudwatch_log_group.jacobs_rds_sns_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_rds_sns_lambda_function]
aws_cloudwatch_log_group.jacobs_lambda_dynamodb_logs: Refreshing state... [id=/aws/lambda/jacobs_lambda_dynamodb]
aws_iam_role.jacobs_lambda_dynamodb_role: Refreshing state... [id=jacobs_lambda_dynamodb_role]
aws_cloudwatch_event_rule.jacobs_rds_events_rule: Refreshing state... [id=jacobs-rds-events-rule]
aws_ssm_parameter.jacobs_ssm_prac_secret: Refreshing state... [id=jacobs_ssm_pg_user]
aws_iam_role.jacobs_rds_sns_lambda_role: Refreshing state... [id=jacobs_rds_sns_lambda_role]
aws_iam_role.jacobs_glue_role: Refreshing state... [id=jacobs_glue_role]
aws_cloudwatch_log_group.jacobs_sqs_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_sqs_lambda_function]
aws_cloudwatch_log_group.aws_ecs_logs_ml: Refreshing state... [id=jacobs_ecs_logs_ml]
aws_key_pair.airflow_ec2_key: Refreshing state... [id=airflow-ec2-key]
aws_sns_topic.jacobs_rds_sns_topic: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-rds-sns-topic]
aws_cloudwatch_log_group.jacobs_lambda_logs: Refreshing state... [id=/aws/lambda/jacobs_lambda_function]
aws_iam_role.jacobs_adhoc_sns_lambda_role: Refreshing state... [id=jacobs_adhoc_sns_lambda_role]
aws_iam_role.jacobs_firehose_role: Refreshing state... [id=jacobs_firehose_role]
aws_iam_user.jacobs_mlflow_user: Refreshing state... [id=jacobs-mlflow-user]
aws_ecs_cluster.jacobs_ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:324816727452:cluster/jacobs_fargate_cluster]
aws_cloudwatch_event_rule.every_15_mins: Refreshing state... [id=python_scheduled_task_test]
aws_iam_role.jacobs_lambda_es_role: Refreshing state... [id=jacobs_lambda_es_role]
aws_cloudwatch_event_rule.etl_rule: Refreshing state... [id=python_scheduled_task_prod]
aws_api_gateway_rest_api.jacobs_api_gateway: Refreshing state... [id=fgvdktt1h3]
aws_iam_role.jacobs_ecs_ecr_role: Refreshing state... [id=jacobs_ecs_ecr_role]
aws_iam_user.jacobs_terraform_user: Refreshing state... [id=jacobs-terraform-user]
aws_iam_group.jacobs_github_group: Refreshing state... [id=github-ecr-cicd]
aws_cloudwatch_log_group.aws_ecs_logs_airflow: Refreshing state... [id=jacobs_ecs_logs_airflow]
aws_s3_bucket.jyablonski_tf_cicd_bucket: Refreshing state... [id=jyablonski-tf-cicd-bucket]
aws_ecr_lifecycle_policy.jacobs_repo_policy: Refreshing state... [id=jacobs_repo]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ses: Refreshing state... [id=jacobs_airflow_user-20211018230933484100000002]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ssm: Refreshing state... [id=jacobs_airflow_user-20211124210309375300000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_execution: Refreshing state... [id=jacobs_airflow_user-20211018230933480900000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_cloudwatch_logs: Refreshing state... [id=jacobs_airflow_user-20211230231428753500000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_ecr: Refreshing state... [id=jacobs_airflow_user-20211018231134709200000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment: Refreshing state... [id=jacobs_airflow_user-20211011013703213600000001]
aws_iam_user_policy_attachment.jacobs_airflow_user_attachment_s3: Refreshing state... [id=jacobs_airflow_user-20211107232055534100000001]
aws_s3_bucket_acl.jyablonski_lambda_bucket_acl: Refreshing state... [id=jyablonski-lambda-bucket,private]
aws_iam_role_policy_attachment.jacobs_lambda_s3_attachment_5: Refreshing state... [id=jacobs_lambda_s3_role-20220121033244641900000001]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=jacobs_lambda_s3_role-20211115225458369200000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment3: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438870600000003]
aws_iam_role_policy_attachment.jacobs_lambda_s3_attachment_4: Refreshing state... [id=jacobs_lambda_s3_role-20211222000709626900000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_attachment_6: Refreshing state... [id=jacobs_lambda_s3_role-20220121034021133800000001]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment2: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438866400000002]
aws_iam_role_policy_attachment.jacobs_lambda_s3_role_attachment1: Refreshing state... [id=jacobs_lambda_s3_role-20211115224438861200000001]
aws_s3_bucket_acl.jacobs_sqs_sns_bucket_acl: Refreshing state... [id=jacobs-sqs-bucket,private]
aws_sns_topic.jacobs_sns_topic: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-first-sns-topic]
aws_s3_bucket_acl.kinesis_bucket_acl: Refreshing state... [id=jacobs-kinesis-bucket,private]
aws_iam_policy.lambda_es_policy: Refreshing state... [id=arn:aws:iam::324816727452:policy/lambda-es-policy]
aws_elasticsearch_domain.jacobs_opensearch_cluster: Refreshing state... [id=arn:aws:es:us-east-1:324816727452:domain/jacobs-opensearch-cluster]
aws_s3_bucket_public_access_block.jacobs_bucket_tf_access: Refreshing state... [id=jacobsbucket97]
aws_s3_bucket_lifecycle_configuration.jacobs_bucket_lifecycle_policy: Refreshing state... [id=jacobsbucket97]
aws_s3_bucket_policy.allow_access_from_another_account: Refreshing state... [id=jacobsbucket97]
aws_s3_bucket_acl.jyablonski_bucket_tf_acl: Refreshing state... [id=jacobsbucket97,private]
aws_s3_bucket_acl.jyablonski_unhappy_bucket_acl: Refreshing state... [id=jyablonski-unhappy-bucket,private]
aws_subnet.jacobs_public_subnet_2: Refreshing state... [id=subnet-0047afa4a7e93ec89]
aws_security_group.jacobs_task_security_group_tf: Refreshing state... [id=sg-0e3e9289166404b84]
aws_subnet.jacobs_public_subnet: Refreshing state... [id=subnet-0652b6b91d94ebcd0]
aws_internet_gateway.jacobs_gw: Refreshing state... [id=igw-021b87557060ce529]
aws_cloudwatch_event_target.jacobs_rds_sns_topic_target: Refreshing state... [id=jacobs-rds-events-rule-SendRDSEventsToSNS]
aws_iam_user_policy_attachment.jacobs_mlflow_user_attachment_s3: Refreshing state... [id=jacobs-mlflow-user-20220315144005082100000001]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment: Refreshing state... [id=jacobs_ecs_role-20210828175249551700000003]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment_s3: Refreshing state... [id=jacobs_ecs_role-20211107185721292100000001]
aws_api_gateway_resource.api_gateway_products: Refreshing state... [id=geaudg]
aws_api_gateway_rest_api_policy.jacobs_api_policy: Refreshing state... [id=fgvdktt1h3]
aws_api_gateway_resource.api_gateway_product: Refreshing state... [id=fxfqkw]
aws_api_gateway_deployment.jacobs_api_gateway_deployment: Refreshing state... [id=b27ltq]
aws_api_gateway_resource.api_gateway_health: Refreshing state... [id=kg2mm4]
aws_cloudwatch_log_resource_policy.jacobs_es_cluster_logs: Refreshing state... [id=jacobs_es_cluster_logs]
aws_iam_user_policy_attachment.jacobs_terraform_user_attachment: Refreshing state... [id=jacobs-terraform-user-20211211210959483500000001]
aws_iam_group_policy_attachment.jacobs_github_group_policy_attach: Refreshing state... [id=github-ecr-cicd-20210828175249204100000001]
aws_iam_group_membership.jacobs_github_group_attach: Refreshing state... [id=tf-testing-group-membership]
aws_iam_role_policy_attachment.jacobs_ecs_role_attachment_ses: Refreshing state... [id=jacobs_ecs_role-20210904181629178300000001]
aws_iam_role_policy_attachment.jacobs_lambda_dynamodb_role_attachment1: Refreshing state... [id=jacobs_lambda_dynamodb_role-20220130185654853600000002]
aws_iam_role_policy_attachment.jacobs_lambda_dynamodb_role_attachment2: Refreshing state... [id=jacobs_lambda_dynamodb_role-20220130185654851000000001]
aws_lambda_function.jacobs_lambda_dynamodb_function: Refreshing state... [id=jacobs_lambda_dynamodb]
aws_iam_role_policy_attachment.jacobs_rds_sns_lambda_log_attachment2: Refreshing state... [id=jacobs_rds_sns_lambda_role-20220214221148698200000001]
aws_iam_role_policy_attachment.jacobs_rds_sns_lambda_log_attachment1: Refreshing state... [id=jacobs_rds_sns_lambda_role-20220214221148698400000002]
aws_iam_role_policy_attachment.jacobs_rds_sns_lambda_log_attachment_3: Refreshing state... [id=jacobs_rds_sns_lambda_role-20220214232214848900000001]
aws_glue_job.jacobs_glue_job: Refreshing state... [id=jacobs_glue_job]
aws_iam_role_policy_attachment.jacobs_glue_role_attachment1: Refreshing state... [id=jacobs_glue_role-20220311221650755100000001]
aws_lambda_function.jacobs_s3_sqs_lambda_function: Refreshing state... [id=jacobs_sqs_lambda_function]
aws_lambda_function.jacobs_rds_sns_lambda_function: Refreshing state... [id=jacobs_rds_sns_lambda_function]
aws_lambda_function.jacobs_s3_lambda_function: Refreshing state... [id=jacobs_lambda_function]
aws_iam_role_policy_attachment.jacobs_adhoc_sns_lambda_log_attachment2: Refreshing state... [id=jacobs_adhoc_sns_lambda_role-20220217011541320700000003]
aws_iam_role_policy_attachment.jacobs_adhoc_sns_lambda_log_attachment_3: Refreshing state... [id=jacobs_adhoc_sns_lambda_role-20220217011541273300000002]
aws_lambda_function.jacobs_adhoc_sns_lambda_function: Refreshing state... [id=jacobs_adhoc_lambda_function]
aws_iam_role_policy_attachment.jacobs_adhoc_sns_lambda_log_attachment1: Refreshing state... [id=jacobs_adhoc_sns_lambda_role-20220217011541272900000001]
aws_iam_role_policy_attachment.jacobs_kinesis_role_attachment2: Refreshing state... [id=jacobs_firehose_role-20220320155547866900000004]
aws_iam_role_policy_attachment.jacobs_kinesis_role_attachment4: Refreshing state... [id=jacobs_firehose_role-20220320155547866700000003]
aws_iam_role_policy_attachment.jacobs_kinesis_role_attachment1: Refreshing state... [id=jacobs_firehose_role-20220320155547862400000001]
aws_iam_role_policy_attachment.jacobs_lambda_es_role_attachment1: Refreshing state... [id=jacobs_lambda_es_role-20220201024731234400000001]
aws_iam_role_policy_attachment.jacobs_kinesis_role_attachment3: Refreshing state... [id=jacobs_firehose_role-20220320155547865000000002]
aws_sqs_queue.jacobs_sqs_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/324816727452/jacobs-first-sqs]
aws_sns_topic_policy.jacobs_rds_sns_topic_policy: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-rds-sns-topic]
aws_iam_role_policy_attachment.jacobs_lambda_es_role_attachment2: Refreshing state... [id=jacobs_lambda_es_role-20220201024731235300000002]
aws_ssm_parameter.jacobs_ssm_subnet2: Refreshing state... [id=jacobs_ssm_subnet2]
aws_ssm_parameter.jacobs_ssm_sg_task: Refreshing state... [id=jacobs_ssm_sg_task]
aws_security_group.jacobs_rds_security_group_tf: Refreshing state... [id=sg-04be859fa9163a50a]
aws_route_table.jacobs_public_route_table: Refreshing state... [id=rtb-09226b87b7cd35ec8]
aws_iam_role_policy_attachment.jacobs_ecs_ecr_role_attachment: Refreshing state... [id=jacobs_ecs_ecr_role-20210828175249545600000002]
aws_ssm_parameter.jacobs_ssm_subnet1: Refreshing state... [id=jacobs_ssm_subnet1]
aws_db_subnet_group.jacobs_subnet_group: Refreshing state... [id=jacobs-subnet-group]
aws_instance.jacobs_ec2_airflow: Refreshing state... [id=i-0de57e8d89f3de6aa]
aws_s3_bucket_acl.jyablonski_tf_cicd_bucket_acl: Refreshing state... [id=jyablonski-tf-cicd-bucket,private]
aws_api_gateway_method.api_gateway_health_get: Refreshing state... [id=agm-fgvdktt1h3-kg2mm4-GET]
aws_api_gateway_method.api_gateway_products_get: Refreshing state... [id=agm-fgvdktt1h3-geaudg-GET]
aws_api_gateway_stage.jacobs_deployment_stage: Refreshing state... [id=ags-fgvdktt1h3-Dev]
aws_api_gateway_method.api_gateway_product_delete: Refreshing state... [id=agm-fgvdktt1h3-fxfqkw-DELETE]
aws_api_gateway_method.api_gateway_product_patch: Refreshing state... [id=agm-fgvdktt1h3-fxfqkw-PATCH]
aws_api_gateway_method.api_gateway_product_post: Refreshing state... [id=agm-fgvdktt1h3-fxfqkw-POST]
aws_api_gateway_method.api_gateway_product_get: Refreshing state... [id=agm-fgvdktt1h3-fxfqkw-GET]
aws_lambda_permission.allow_bucket1: Refreshing state... [id=AllowExecutionFromS3Bucket]
aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=jyablonski-lambda-bucket]
aws_sns_topic_subscription.allow_sns_invoke_rds_lambda: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-rds-sns-topic:3a25486b-8d82-4eca-8950-f6eff0470bbd]
aws_lambda_permission.allow_rds_sns_lambda_permission: Refreshing state... [id=AllowRDSLambdaExecutionFromSNS]
aws_sns_topic_subscription.enable_adhoc_lambda_sns: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-adhoc-sns-topic:c9b92f07-94e8-47af-8670-6fb1b10d4699]
aws_lambda_permission.allow_adhoc_sns_lambda_permission: Refreshing state... [id=AllowadhocLambdaExecutionFromSNS]
aws_sns_topic_subscription.enable_lambda_sns: Refreshing state... [id=arn:aws:sns:us-east-1:324816727452:jacobs-first-sns-topic:781d5c14-ab92-4751-b132-e4a82e5ddaea]
aws_lambda_permission.allow_bucket_sqs: Refreshing state... [id=AllowExecutionFromS3Bucketsqs]
aws_lambda_event_source_mapping.enable_lambda_sqs: Refreshing state... [id=29fbb536-6cb0-46e8-8788-faabd9e0cdaa]
aws_route_table_association.jacobs_public_route_2: Refreshing state... [id=rtbassoc-0e5a3b38154f8baf6]
aws_route_table_association.jacobs_public_route: Refreshing state... [id=rtbassoc-0b0bbb75130f63d05]
aws_lambda_permission.apigw_lambda_products_get: Refreshing state... [id=AllowExecutionFromAPIGatewayGetProducts]
aws_api_gateway_integration.api_gateway_products_get_integration: Refreshing state... [id=agi-fgvdktt1h3-geaudg-GET]
aws_lambda_permission.apigw_lambda_health: Refreshing state... [id=AllowExecutionFromAPIGatewayGetHealth]
aws_api_gateway_integration.api_gateway_health_get_integration: Refreshing state... [id=agi-fgvdktt1h3-kg2mm4-GET]
aws_lambda_permission.apigw_lambda_product_delete: Refreshing state... [id=AllowExecutionFromAPIGatewayDeleteProduct]
aws_api_gateway_integration.api_gateway_product_delete_integration: Refreshing state... [id=agi-fgvdktt1h3-fxfqkw-DELETE]
aws_lambda_permission.apigw_lambda_product_patch: Refreshing state... [id=AllowExecutionFromAPIGatewayPatchProduct]
aws_api_gateway_integration.api_gateway_product_patch_integration: Refreshing state... [id=agi-fgvdktt1h3-fxfqkw-PATCH]
aws_api_gateway_integration.api_gateway_product_post_integration: Refreshing state... [id=agi-fgvdktt1h3-fxfqkw-POST]
aws_lambda_permission.apigw_lambda_product_post: Refreshing state... [id=AllowExecutionFromAPIGatewayPostProduct]
aws_api_gateway_integration.api_gateway_product_get_integration: Refreshing state... [id=agi-fgvdktt1h3-fxfqkw-GET]
aws_lambda_permission.apigw_lambda_product: Refreshing state... [id=AllowExecutionFromAPIGatewayGetProduct]
aws_s3_bucket_notification.bucket_notification_sqs_sns: Refreshing state... [id=jacobs-sqs-bucket]
aws_db_instance.jacobs_rds_tf: Refreshing state... [id=jacobs-rds-server]
aws_ecs_task_definition.jacobs_ecs_task_airflow: Refreshing state... [id=jacobs_task_airflow]
aws_ecs_task_definition.jacobs_ecs_task: Refreshing state... [id=jacobs_task]
aws_ecs_task_definition.jacobs_ecs_task_ml: Refreshing state... [id=jacobs_task_ml]
aws_cloudwatch_event_target.ecs_scheduled_task: Refreshing state... [id=python_scheduled_task_prod-jacobs_target_id]
aws_cloudwatch_event_target.ecs_scheduled_task_ml: Refreshing state... [id=python_scheduled_task_ml-jacobs_target_id]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_db_instance.jacobs_rds_tf has changed
  ~ resource "aws_db_instance" "jacobs_rds_tf" {
        id                                    = "jacobs-rds-server"
      ~ latest_restorable_time                = "2022-05-01T14:39:38Z" -> "2022-05-01T14:44:38Z"
        name                                  = "jacob_db"
        tags                                  = {
            "Environment" = "Prod"
            "Name"        = "Jacobs TF Project"
        }
        # (57 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.jacobs_bucket_tf_dev will be created
  + resource "aws_s3_bucket" "jacobs_bucket_tf_dev" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "jacobsbucket97-dev"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Environment" = "Prod"
          + "Name"        = "Jacobs TF Project"
        }
      + tags_all                             = {
          + "Environment" = "Prod"
          + "Name"        = "Jacobs TF Project"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # aws_s3_bucket_acl.jyablonski_bucket_tf_acl_dev will be created
  + resource "aws_s3_bucket_acl" "jyablonski_bucket_tf_acl_dev" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # aws_s3_bucket_policy.allow_access_from_another_account_dev will be created
  + resource "aws_s3_bucket_policy" "allow_access_from_another_account_dev" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.jacobs_bucket_tf_access_dev will be created
  + resource "aws_s3_bucket_public_access_block" "jacobs_bucket_tf_access_dev" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```
</details>
*Pusher: @jyablonski, Action: `pull_request`*